Compterendu.org
* Config latex                                                       :ignore:

#+LANGUAGE:french
#+OPTIONS: toc:nil %pour ne pas afficher la tdm avant la page de garde
#+OPTIONS: H:2 %export les titre comme des titres jusqu'au niveau 6. Sinon, fait des liste


#+SETUPFILE:Latex/Setupfile/Styleslatex/org-plain-latex.org


#+SETUPFILE:Latex/Setupfile/Pagedegarde/Pagedegarde1/pourpagedegarde1.org



#+Latex_header:\usepackage{lastpage} %les latex header ici
#+Latex_header:\usepackage{MnSymbol,wasysym} %les smileys





#+BEGIN_EXPORT latex
%chargement de la page de garde
\input{$PWD/Latex/Setupfile/Pagedegarde/Pagedegarde1/pagedegarde1.org}
#+END_EXPORT




#+TOC: headlines 2 % afficher tdm ici, nombre de "sous titre", 3= va jusqu'à titre 3

* Newpage :ignore:
\newpage


* Problèmes potentiels identifiés au départ

Ce jeu à en effet quelques spécificités :

** Gestion des fusions

Tout d'abord, le jeu peut fusionner plusieurs cases en même temps, sur différentes lignes et colonnes. De plus, sur ces mêmes lignes et colonnes comme, par exemple, avec cet exemple :

| 2 | 2 | 4 | 4 |
| 4 | 8 | 2 | 2 |
| 0 | 0 | 0 | 0 |
| 0 | 0 | 0 | 0 |

Si le joueur fusionne à gauche, nous devrons fusionner les 2 ET les 4 présents sur la première ligne.

De plus, lorsque l'on doit fusionner plusieurs cases, nous devons mettre les résultats de la fusion “collés” dans la direction voulue.
Nous devons donc gérer ce cas en plusieurs étapes.

** Différentes taille

Nous souhaitons faire plusieurs tailles de 2048, nous voulons donc avoir la possibilité de changer la taille de la grille, en laissant le choix à l'utilisateur de choisir, pourquoi pas, une taille 100x100 ou une taille 2x5.

** Gestion des sauvegardes

Nous voulons que notre joueur puisse faire une pause. Nous nous imposons donc de faire un système de sauvegarde rapide et efficace.



* Présentation du programme console

Nous ne mettrons pas l'intégralité du code des différentes résolutions, mais il est consultable dans les fichiers joints.

** Introduction à la structure Terrain/ter 

Nous avons choisis d'utiliser une structure pour pouvoir manipuler notre grille aisément, cette structure s'appelant /Terrain/.

#+begin_src C
  
  typedef struct Terrain{
  int **tab;
  int max;
  int tailleX;
  int tailleY;
  int vide;
  int score;
}ter;


  
#+end_src

Elle est composé de divers éléments, mais seulement d'entiers :

1. Un tableau en 2 dimensions, qui serra la grille en elle même.
2. max, qui sera l'entier présent dans la grille maximal. Permet de gérer le cas de “victoire” si l'on fait 2048.
3. tailleX, qui sera le nombre de colonne
4. tailleY, qui sera le nombre de ligne
5. vide, qui sera le nombre de case vide du tableau (utile pour plus tard)
6. score, qui sera le score du Terrain en cours


Toutes ces éléments sont présents pour simplifier le nombre de paramètre pris par les divers fonctions suivantes.
Dans la suite de ce document, et ainsi que dans le code, /Terrain/ sera abrégé en /ter/
   



** Présentation des différentes fonctions  avec leurs signatures

*** InitVide

#+begin_src C
ter InitVide(int n, int y);
#+end_src

Cette fonction prend deux entiers et renvoie un ter de la taille de /n/ et de /y/.
Elle nous permet de créer notre grille proprement.

*** afficheTer

#+begin_src C
void afficheTer(ter T);
#+end_src

afficheTer nous permet, comme son nom l'indique, d'afficher le ter donné en paramètre.

*** SetRandomCase

#+begin_src C
int SetRandomCase(ter *T, int n);
#+end_src

SetRandomCase permet d'initialiser une case =vide= à une certaine valeur. Elle prend en paramètre un entier, qui détermine la valeur de la case (2 ou 4). \\
Pour placer la case, nous prenons un nombre aléatoire dans le nombre de case vide(qu'on a décrit dans la structure /Terrain/). Puis, nous parcourons le tableau pour trouver l'emplacement de cette case. Petit particularité : le nombre de case /x/ parcouru ne s'incrémente pas si la case est déjà rempli. C'est donc après /x/ case vide que l'on initialise la case numéro /x/ + *nombre de case déjà remplie* à une valeur 2 ou 4.

*** CaseMouve

#+begin_src C
void CaseMouve(ter *T, int depNum);
#+end_src

Cette fonction est sûrement une des plus importante. En effet, elle prend en paramètre un pointeur sur un terrain ainsi qu'un déplacement. 
Par manque de place sur ce rapport, nous ne pouvons la décrire entièrement. En revanche, le code de cette fonction est particulièrement bien détaillé et est disponible dans [[file:FonctionJeu.c][Fonction.c]].\\
Pour expliquer simplement le fonctionnement de cette fonction, nous utilisons une double boucle /for/ qui permet de parcourir l'ensemble de la grille dans différentes direction en fonction de /depNum/, qui est la direction choisie. Dans le cas d'une fusion, on vient stocker la position de la case fusionnée afin de ne pas la refusionner (voir [[*Problèmes potentiels identifiés au départ][gestion des problèmes au début du document]]).
\\Dépend de la fonction [[*CanDep][CanDep]] pour vérifier si le joueur peut se déplacer ou à perdu.

*** CanDep

#+begin_src C
int CanDep(ter T, int depNum);
#+end_src

Également essentielle, cette fonction permet de savoir si un déplacement dans la direction choisi est possible sur le ter passé en paramètre.

Nous avons géré le game over comme ceci ([[file:main.c][dans le main.c]]) :
#+begin_src C
  for(int i = 1;i < 5; i++){
    if(CanDep(plateau, i)){
      // si le joueur peu bouger on change cette variable
      GameOver = 0;
      break;
    }
   }
#+end_src

Nous testons donc tous les coup grâce à cette fonction à chaque fois après le coup du joueur. Si le jeu détecte que le joueur pourra faire un déplacement, alors /CanDep/ retournera 1, ce qui mettra la variable /GameOver/ à 0, le joueur n'aura donc pas perdu. Dans le cas contraire, /GameOver/ restera à 1 et le joueur aura donc perdu, car il ne pourra pas faire de mouvement au prochain coup.

*** LibereTer

#+begin_src C
void LibereTer(ter *T);
#+end_src

Comme son nom l'indique, cette fonction permet simplement de libérer un /ter/ proprement.

*** ReadEnCoursSave


#+begin_src C
ter ReadEnCoursSave(float time, char *name);
#+end_src


Grâce à cette fonction permet, nous pouvons lire le fichier de sauvegarde. Plus de détail dans la suite du document ([[*Gestion des sauvegardes][ici]]).

*** copiFile

#+begin_src C
void copiFile(char *old, char *nouv);
#+end_src

Cette fonction permet de prendre deux chaînes de caractères qui sont les noms de fichiers, et qui copie le contenu de /old/ dans /nouv/, qui seront les noms des fichiers.

*** writesaveFile


#+begin_src C
void writesaveFile(int hightscore, int endedGamesWin, int endedLoseGame, char mouvsup[4], int nbReplay, int SreenSizeX, int SreenSizeY, int isFullscreen, int sound, int music, int time);
#+end_src

Enfin, cette dernière fonction nous permet de sauvegarder les options / information du joueur dans un fichier que nous pouvons récupérer, en prenant en paramètres divers éléments. Plus
de détail dans la suite de ce document ([[*Gestion des sauvegardes][ici]]).

** Explication du fonctionnement du jeu de base

Les fonctions étant définis dans /FonctionJeu.c/, le jeu en lui même est entièrement présent dans le /main.c/.

