Compterendu.tex
% Created 2021-12-16 Thu 10:26
% Intended LaTeX compiler: pdflatex
\documentclass[letter]{article}
                      \usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,left=2cm,right=2cm,top=2cm,bottom=2cm]{geometry}
\usepackage[frenchb, ]{babel}
\usepackage{libertine}
\usepackage[pdftex]{graphicx}
\setlength{\parskip}{1ex plus 0.5ex minus 0.2ex}
\newcommand{\hsp}{\hspace{20pt}}
\newcommand{\HRule}{\rule{\linewidth}{0.5mm}}
\usepackage{lastpage} %les latex header ici
\usepackage{MnSymbol,wasysym} %les smileys
\date{\today}
\title{}
\begin{document}

%chargement de la page de garde
\input{$PWD/Latex/Setupfile/Pagedegarde/Pagedegarde1/pagedegarde1.org}




\setcounter{tocdepth}{2}
\tableofcontents

\newpage


\section{Problèmes potentiels identifiés au départ}
\label{sec:orgdda6988}

Ce jeu à en effet quelques spécificités :

\subsection{Gestion des fusions}
\label{sec:org5b16100}

Tout d'abord, le jeu peut fusionner plusieurs cases en même temps, sur différentes lignes et colonnes. De plus, sur ces mêmes lignes et colonnes comme, par exemple, avec cet exemple :

\begin{center}
\begin{tabular}{rrrr}
2 & 2 & 4 & 4\\
4 & 8 & 2 & 2\\
0 & 0 & 0 & 0\\
0 & 0 & 0 & 0\\
\end{tabular}
\end{center}

Si le joueur fusionne à gauche, nous devrons fusionner les 2 ET les 4 présents sur la première ligne.

De plus, lorsque l'on doit fusionner plusieurs cases, nous devons mettre les résultats de la fusion “collés” dans la direction voulue.
Nous devons donc gérer ce cas en plusieurs étapes.

\subsection{Différentes taille}
\label{sec:org5e7ec16}

Nous souhaitons faire plusieurs tailles de 2048, nous voulons donc avoir la possibilité de changer la taille de la grille, en laissant le choix à l'utilisateur de choisir, pourquoi pas, une taille 100x100 ou une taille 2x5.

\subsection{Gestion des sauvegardes}
\label{sec:org4ed625b}

Nous voulons que notre joueur puisse faire une pause. Nous nous imposons donc de faire un système de sauvegarde rapide et efficace.



\section{Présentation du programme console}
\label{sec:orgbcdb2a0}

Nous ne mettrons pas l'intégralité du code des différentes résolutions, mais il est consultable dans les fichiers joints.

\subsection{Introduction à la structure Terrain/ter}
\label{sec:org92d8115}

Nous avons choisis d'utiliser une structure pour pouvoir manipuler notre grille aisément, cette structure s'appelant \emph{Terrain}.

\begin{verbatim}

  typedef struct Terrain{
  int **tab;
  int max;
  int tailleX;
  int tailleY;
  int vide;
  int score;
}ter;



\end{verbatim}

Elle est composé de divers éléments, mais seulement d'entiers :

\begin{enumerate}
\item Un tableau en 2 dimensions, qui serra la grille en elle même.
\item max, qui sera l'entier présent dans la grille maximal. Permet de gérer le cas de “victoire” si l'on fait 2048.
\item tailleX, qui sera le nombre de colonne
\item tailleY, qui sera le nombre de ligne
\item vide, qui sera le nombre de case vide du tableau (utile pour plus tard)
\item score, qui sera le score du Terrain en cours
\end{enumerate}


Toutes ces éléments sont présents pour simplifier le nombre de paramètre pris par les divers fonctions suivantes.
Dans la suite de ce document, et ainsi que dans le code, \emph{Terrain} sera abrégé en \emph{ter}




\subsection{Présentation des différentes fonctions  avec leurs signatures}
\label{sec:orgd496a5c}

\begin{enumerate}
\item InitVide
\label{sec:org81e2535}

\begin{verbatim}
ter InitVide(int n, int y);
\end{verbatim}

Cette fonction prend deux entiers et renvoie un ter de la taille de \emph{n} et de \emph{y}.
Elle nous permet de créer notre grille proprement.

\item afficheTer
\label{sec:org3c729dd}

\begin{verbatim}
void afficheTer(ter T);
\end{verbatim}

afficheTer nous permet, comme son nom l'indique, d'afficher le ter donné en paramètre.

\item SetRandomCase
\label{sec:orgc1d752d}

\begin{verbatim}
int SetRandomCase(ter *T, int n);
\end{verbatim}

SetRandomCase permet d'initialiser une case \texttt{vide} à une certaine valeur. Elle prend en paramètre un entier, qui détermine la valeur de la case (2 ou 4). \\
Pour placer la case, nous prenons un nombre aléatoire dans le nombre de case vide(qu'on a décrit dans la structure \emph{Terrain}). Puis, nous parcourons le tableau pour trouver l'emplacement de cette case. Petit particularité : le nombre de case \emph{x} parcouru ne s'incrémente pas si la case est déjà rempli. C'est donc après \emph{x} case vide que l'on initialise la case numéro \emph{x} + \textbf{nombre de case déjà remplie} à une valeur 2 ou 4.

\item CaseMouve
\label{sec:org321129a}

\begin{verbatim}
void CaseMouve(ter *T, int depNum);
\end{verbatim}

Cette fonction est sûrement une des plus importante. En effet, elle prend en paramètre un pointeur sur un terrain ainsi qu'un déplacement. 
Par manque de place sur ce rapport, nous ne pouvons la décrire entièrement. En revanche, le code de cette fonction est particulièrement bien détaillé et est disponible dans \href{FonctionJeu.c}{Fonction.c}.\\
Pour expliquer simplement le fonctionnement de cette fonction, nous utilisons une double boucle \emph{for} qui permet de parcourir l'ensemble de la grille dans différentes direction en fonction de \emph{depNum}, qui est la direction choisie. Dans le cas d'une fusion, on vient stocker la position de la case fusionnée afin de ne pas la refusionner (voir \hyperref[sec:orgdda6988]{gestion des problèmes au début du document}).
$\backslash$\Dépend de la fonction \hyperref[sec:org873dbfd]{CanDep} pour vérifier si le joueur peut se déplacer ou à perdu.

\item CanDep
\label{sec:org873dbfd}

\begin{verbatim}
int CanDep(ter T, int depNum);
\end{verbatim}

Également essentielle, cette fonction permet de savoir si un déplacement dans la direction choisi est possible sur le ter passé en paramètre.

Nous avons géré le game over comme ceci (\href{main.c}{dans le main.c}) :
\begin{verbatim}
for(int i = 1;i < 5; i++){
  if(CanDep(plateau, i)){
    // si le joueur peu bouger on change cette variable
    GameOver = 0;
    break;
  }
 }
\end{verbatim}

Nous testons donc tous les coup grâce à cette fonction à chaque fois après le coup du joueur. Si le jeu détecte que le joueur pourra faire un déplacement, alors \emph{CanDep} retournera 1, ce qui mettra la variable \emph{GameOver} à 0, le joueur n'aura donc pas perdu. Dans le cas contraire, \emph{GameOver} restera à 1 et le joueur aura donc perdu, car il ne pourra pas faire de mouvement au prochain coup.

\item LibereTer
\label{sec:org523b9f6}

\begin{verbatim}
void LibereTer(ter *T);
\end{verbatim}

Comme son nom l'indique, cette fonction permet simplement de libérer un \emph{ter} proprement.

\item ReadEnCoursSave
\label{sec:org1b2decf}


\begin{verbatim}
ter ReadEnCoursSave(float time, char *name);
\end{verbatim}


Grâce à cette fonction permet, nous pouvons lire le fichier de sauvegarde. Plus de détail dans la suite du document (\hyperref[sec:org4ed625b]{ici}).

\item copiFile
\label{sec:orgad00818}

\begin{verbatim}
void copiFile(char *old, char *nouv);
\end{verbatim}

Cette fonction permet de prendre deux chaînes de caractères qui sont les noms de fichiers, et qui copie le contenu de \emph{old} dans \emph{nouv}, qui seront les noms des fichiers.

\item writesaveFile
\label{sec:org65e9c17}


\begin{verbatim}
void writesaveFile(int hightscore, int endedGamesWin, int endedLoseGame, char mouvsup[4], int nbReplay, int SreenSizeX, int SreenSizeY, int isFullscreen, int sound, int music, int time);
\end{verbatim}

Enfin, cette dernière fonction nous permet de sauvegarder les options / information du joueur dans un fichier que nous pouvons récupérer, en prenant en paramètres divers éléments. Plus
de détail dans la suite de ce document (\hyperref[sec:org4ed625b]{ici}).
\end{enumerate}

\subsection{Explication du fonctionnement du jeu de base}
\label{sec:org2c80fc0}

Les fonctions étant définis dans \emph{FonctionJeu.c}, le jeu en lui même est entièrement présent dans le \emph{main.c}.
