Compterendu.org
*** Cas du switch :ignore:

Notre programme est basé sur un switch, qui nous laisse 6 choix (dont 1 de fermeture) :

1. Le premier cas est lors de l'arrivé dans le jeu. Il renvoie systématiquement à :
2. Notre menu, qui est le cas numéro 2. C'est ici que le joueur décide si il veut lancer une nouvelle partie, voir un replay, etc. On peut distinguer 4 cas majeurs :
   - Lancement d'un jeu
   - Voir un replay
   - Modifier les options
   - Quitter le jeu
3. Subséquemment, le cas 3 nous permet de gérer les déplacement du joueur ainsi que l’affichage du jeu.
4. Ensuite, le quatrième cas permet de gérer lorsque que le joueur à fini la partie. Affiche si il a gagné ou perdu (score inférieur/supérieur à 2048), ainsi que son meilleur score.
5. Le cas 5 est le cas où l'initialisation du terrain s'est mal passé. On va alors au cas -1.
6. Le cas 6 est dédié à la modification des paramètres du jeu (tel que les touches par exemple).
7. le septième cas, nous affichons la fenêtre graphique.
8. Enfin, le cas -1 est réservé pour arrêter le jeu et le fermer proprement.


 
** Présentation des nouvelles fonctionnalités

*** Gestion des sauvegardes

**** Présentation du fichier de sauvegarde




Un fichier de sauvegarde est présenté de cette manière :

Unelettre Unchiffre Unautrechiffre
Unelettre Unchiffre Unautrechiffre Unelettre Unchiffre Unautrechiffre Unelettre Unchiffre Unautrechiffre [...]

Un exemple concret :
#+begin_example
N 4 2
n 2 3 n 2 4 h 2 3 b 2 2 g 2 4 g 
#+end_example

Tout d'abord, les trois premiers éléments :
1. Sert à déterminer le “type” de la sauvegarde (une seule présente lors du rendu).
2. Les deux nombres suivant permettent d'avoir la taille du terrain.

Puis, les autres sont simplement la partie enregistrer.
Comment me direz vous ?
Et bien, la lettre donne la direction (g gauche, d droite, etc, n rien (c'est le moment où l'on ajoute à une case vide le chiffe 2 ou 4)), le deuxième nombre donne la valeur obtenue lors de la génération aléatoire, et le dernier donne l'emplacement où ce nombre est apparu en suivant le [[*SetRandomCase][principe décrit dans SetRandomCase]].


**** La sauvegarde en elle-même

La gestion des sauvegardes est particulière.
En effet, lorsque le joueur joue un coup, nous enregistrons, selon la méthode décrite [[*Présentation du fichier de sauvegarde][ici]], les différents éléments nécessaires à la sauvegarde.
C'est-à-dire qu'à chaque fois que le joueur effectue un coup, nous récupérons les éléments nécessaires pour pouvoir simuler sa partie pour plus tard.

**** Récupération de la sauvegarde (avec [[*ReadEnCoursSave][ReadEnCoursSave]])

La sauvegarde est récupérée en deux étapes :

***** Lecture du fichier

Pour lire le fichier de sauvegarde, nous avons besoin de la fonction [[*ReadEnCoursSave][ReadEnCoursSave]]. En effet, cette fonction permet de lire les informations présentes dans le fichier de sauvegarde donné

#+begin_src C
FILE *save = fopen(SAVE_NAME, "r");
#+end_src

où SAVE_NAME est une macro qui est le nom du fichier de la sauvegarde (non modifiable par le joueur).

De plus, cette fonction permet de recréer exactement le même terrain de la sauvegarde avec, on l'avoue, un petit subterfuge :



***** Replay automatique

Lors de l'appel de la fonction, nous créons d'abord le terrain avec le tableau de la bonne dimension. Nous lisons donc la première ligne du fichier des options.
Puis, nous parcourons la deuxième lignes. Nous stockons dans une chaîne de caractère un seul et unique coup. Nous avons donc besoin de stocker une lettre et 2 nombre.
Le fichier de sauvegarde ressemblant à ceci :

#+begin_example
N unnombre unautre
n 2 31 n 2 4 h 2 3 b 2 22 g 2 4 g 
#+end_example

nous devons compter le nombre d'espace, et non le nombre de caractère (ici nous avons 31 et 22 qui ne marcherait pas) pour séparer deux coups. Quand ce nombre d'espace atteint 3, nous somme donc en présence du coup suivant.
\\
Enfin, pour jouer le replay, nous avons juste à "relancer" le jeu, mais au lieu de demander au joueur de jouer, nous mettons les différents coups récupérer précédemment pour faire le fameux replay. De plus, pour continuer une partie, nous ne faisons que faire un replay instantané de la partie précédemment chargée.


*** Fichier paramètre

Le fichier paramètre s'appelle Parametres, et posséde plusieurs éléments :


#+begin_example

High score
Nombre de victoire
Nombre de défaite
Les nouvelles touches  x  4
Nombre de replay (pour le nom du fichier des replays au fur et à mesure)
La taille de l'écran graphique en X
La taille de l'écran graphique en Y
Fullscreen (0 = non et 1 = oui)
Volume du son lors des mouvements
Volume de la musique
Variable qui détermine la vitesse de jeu (TIME dans les paramètres SDL)


#+end_example

*** Possibilité de mapper les touches de déplacement

Comme on peut le voir dans la partie précédente, le joueur peut lier ses touches de déplacements avec d'autres touches du clavier.


* La partie SDL

Le code qui nous permet de gérer la fenêtre SDL est disponible [[file:render.c][ici]], et ne sera pas entièrement expliqué (limité par les 5 pages).

** Début

Pour démarrer SDL, nous devons initialiser de nombreuses variables, comme par exemple :

- La variable /etapeactuelledujeu/, qui nous permet de fermer SDL si elle est égale à 0,
- /TailleX et TailleY/, qui vont nous permettre de gérer la taille de l'écran,
- des variables permettant de garder un nombre d'image par seconde (fps) constant et agréable
- des variables permettant de détecter où le curseur de la souris se trouve sur l'écran
- les varibles permettant de dessiner le graphique
- etc. 


Tout ceci est stocké dans une structure de type /screen/.


** Affichage et fonctionnalité

*** Affichage

Pour effectuer l'affichage d'une fenêtre SDL, nous devons passer par une boucle /while/.

Puis, nous distinguerons trois cas grâce à un /if/ (et /else if/).

1. Dans le premier cas, SDL dessinera l'écran, s'il n'a pas été dessiné depuis un certain temps
2. Sinon, nous vérifierons également si les courbes sont en adéquation avec les polynômes. Si ce n'est pas le cas, nous entrons alors dans le /else if/ qui va nous permettre d'écraser l'image précédente. Enfin,
3. si nous passons les deux conditions précédentes, nous devons *absolument* endormir le Central Processing Unit (CPU). Cela nous permet de ne pas utiliser tout le processeur de l'ordinateur.

Puis, nous avons aussi un cas de débogage. En effet, si l'on n'est pas entré dans le while depuis une seconde ou plus, il peut y avoir un problème. On recommence alors une seconde "propre", en mettant certaines variables à 0.

*** Les différentes fonctionnalités présentes

**** Le bouton console

Lorsque vous cliquez sur le bouton en bas à gauche, le jeu bascule avec l'interface console, ce qui permet au joueur de "choisir" s'il veut jouer avec SDL ou non.

**** F11

La touche F11 nous permet de mettre en plein écran, et d'avoir ainsi un petit effet sympas !

**** Taille de la fenêtre

La taille de la fenêtre est complètement géré par les variables /TailleX et TailleY/ qui, lorsque l'utilisateur change la taille de la fenêtre, se mettent à jour en temps réel.



**** Animations des cases 


Pour faire cette animation, nous récupérons dans chaque cas de bloc le nombre de déplacement qu'il doit faire, puis, nous divisons ce déplacement par le temps choisi par l'utilisateur.



