Compterendu.tex

Notre programme est basé sur un switch, qui nous laisse 6 choix (dont 1 de fermeture) :

\begin{enumerate}
\item Le premier cas est lors de l'arrivé dans le jeu. Il renvoie systématiquement à :
\item Notre menu, qui est le cas numéro 2. C'est ici que le joueur décide si il veut lancer une nouvelle partie, voir un replay, etc. On peut distinguer 4 cas majeurs :
\begin{itemize}
\item Lancement d'un jeu
\item Voir un replay
\item Modifier les options
\item Quitter le jeu
\end{itemize}
\item Subséquemment, le cas 3 nous permet de gérer les déplacement du joueur ainsi que l’affichage du jeu.
\item Ensuite, le quatrième cas permet de gérer lorsque que le joueur à fini la partie. Affiche si il a gagné ou perdu (score inférieur/supérieur à 2048), ainsi que son meilleur score.
\item Le cas 5 est le cas où l'initialisation du terrain s'est mal passé. On va alors au cas -1.
\item Le cas 6 est dédié à la modification des paramètres du jeu (tel que les touches par exemple).
\item le septième cas, nous affichons la fenêtre graphique.
\item Enfin, le cas -1 est réservé pour arrêter le jeu et le fermer proprement.
\end{enumerate}



\subsection{Présentation des nouvelles fonctionnalités}
\label{sec:org8d37d64}

\begin{enumerate}
\item Gestion des sauvegardes
\label{sec:org5756535}

\begin{enumerate}
\item Présentation du fichier de sauvegarde
\label{sec:org0f3ee4f}




Un fichier de sauvegarde est présenté de cette manière :

Unelettre Unchiffre Unautrechiffre
Unelettre Unchiffre Unautrechiffre Unelettre Unchiffre Unautrechiffre Unelettre Unchiffre Unautrechiffre [\ldots{}]

Un exemple concret :
\begin{verbatim}
N 4 2
n 2 3 n 2 4 h 2 3 b 2 2 g 2 4 g 
\end{verbatim}

Tout d'abord, les trois premiers éléments :
\begin{enumerate}
\item Sert à déterminer le “type” de la sauvegarde (une seule présente lors du rendu).
\item Les deux nombres suivant permettent d'avoir la taille du terrain.
\end{enumerate}

Puis, les autres sont simplement la partie enregistrer.
Comment me direz vous ?
Et bien, la lettre donne la direction (g gauche, d droite, etc, n rien (c'est le moment où l'on ajoute à une case vide le chiffe 2 ou 4)), le deuxième nombre donne la valeur obtenue lors de la génération aléatoire, et le dernier donne l'emplacement où ce nombre est apparu en suivant le \hyperref[sec:orgc1d752d]{principe décrit dans SetRandomCase}.


\item La sauvegarde en elle-même
\label{sec:org639dc9b}

La gestion des sauvegardes est particulière.
En effet, lorsque le joueur joue un coup, nous enregistrons, selon la méthode décrite \hyperref[sec:org0f3ee4f]{ici}, les différents éléments nécessaires à la sauvegarde.
C'est-à-dire qu'à chaque fois que le joueur effectue un coup, nous récupérons les éléments nécessaires pour pouvoir simuler sa partie pour plus tard.

\item Récupération de la sauvegarde (avec \hyperref[sec:org1b2decf]{ReadEnCoursSave})
\label{sec:org86f4453}

La sauvegarde est récupérée en deux étapes :

\begin{enumerate}
\item Lecture du fichier
\label{sec:orgcd8e49d}

Pour lire le fichier de sauvegarde, nous avons besoin de la fonction \hyperref[sec:org1b2decf]{ReadEnCoursSave}. En effet, cette fonction permet de lire les informations présentes dans le fichier de sauvegarde donné

\begin{verbatim}
FILE *save = fopen(SAVE_NAME, "r");
\end{verbatim}

où SAVE\textsubscript{NAME} est une macro qui est le nom du fichier de la sauvegarde (non modifiable par le joueur).

De plus, cette fonction permet de recréer exactement le même terrain de la sauvegarde avec, on l'avoue, un petit subterfuge :



\item Replay automatique
\label{sec:orge6243a2}

Lors de l'appel de la fonction, nous créons d'abord le terrain avec le tableau de la bonne dimension. Nous lisons donc la première ligne du fichier des options.
Puis, nous parcourons la deuxième lignes. Nous stockons dans une chaîne de caractère un seul et unique coup. Nous avons donc besoin de stocker une lettre et 2 nombre.
Le fichier de sauvegarde ressemblant à ceci :

\begin{verbatim}
N unnombre unautre
n 2 31 n 2 4 h 2 3 b 2 22 g 2 4 g 
\end{verbatim}

nous devons compter le nombre d'espace, et non le nombre de caractère (ici nous avons 31 et 22 qui ne marcherait pas) pour séparer deux coups. Quand ce nombre d'espace atteint 3, nous somme donc en présence du coup suivant.

Enfin, pour jouer le replay, nous avons juste à "relancer" le jeu, mais au lieu de demander au joueur de jouer, nous mettons les différents coups récupérer précédemment pour faire le fameux replay. De plus, pour continuer une partie, nous ne faisons que faire un replay instantané de la partie précédemment chargée.
\end{enumerate}
\end{enumerate}


\item Fichier paramètre
\label{sec:orgd651725}

Le fichier paramètre s'appelle Parametres, et posséde plusieurs éléments :


\begin{verbatim}

High score
Nombre de victoire
Nombre de défaite
Les nouvelles touches  x  4
Nombre de replay (pour le nom du fichier des replays au fur et à mesure)
La taille de l'écran graphique en X
La taille de l'écran graphique en Y
Fullscreen (0 = non et 1 = oui)
Volume du son lors des mouvements
Volume de la musique
Variable qui détermine la vitesse de jeu (TIME dans les paramètres SDL)


\end{verbatim}

\item Possibilité de mapper les touches de déplacement
\label{sec:org0c4679c}

Comme on peut le voir dans la partie précédente, le joueur peut lier ses touches de déplacements avec d'autres touches du clavier.
\end{enumerate}


\section{La partie SDL}
\label{sec:org4f8a4f4}

Le code qui nous permet de gérer la fenêtre SDL est disponible \href{render.c}{ici}, et ne sera pas entièrement expliqué (limité par les 5 pages).

\subsection{Début}
\label{sec:org4cd1378}

Pour démarrer SDL, nous devons initialiser de nombreuses variables, comme par exemple :

\begin{itemize}
\item La variable \emph{etapeactuelledujeu}, qui nous permet de fermer SDL si elle est égale à 0,
\item \emph{TailleX et TailleY}, qui vont nous permettre de gérer la taille de l'écran,
\item des variables permettant de garder un nombre d'image par seconde (fps) constant et agréable
\item des variables permettant de détecter où le curseur de la souris se trouve sur l'écran
\item les varibles permettant de dessiner le graphique
\item etc.
\end{itemize}


Tout ceci est stocké dans une structure de type \emph{screen}.


\subsection{Affichage et fonctionnalité}
\label{sec:orge474a03}

\begin{enumerate}
\item Affichage
\label{sec:org5e1fdba}

Pour effectuer l'affichage d'une fenêtre SDL, nous devons passer par une boucle \emph{while}.

Puis, nous distinguerons trois cas grâce à un \emph{if} (et \emph{else if}).

\begin{enumerate}
\item Dans le premier cas, SDL dessinera l'écran, s'il n'a pas été dessiné depuis un certain temps
\item Sinon, nous vérifierons également si les courbes sont en adéquation avec les polynômes. Si ce n'est pas le cas, nous entrons alors dans le \emph{else if} qui va nous permettre d'écraser l'image précédente. Enfin,
\item si nous passons les deux conditions précédentes, nous devons \textbf{absolument} endormir le Central Processing Unit (CPU). Cela nous permet de ne pas utiliser tout le processeur de l'ordinateur.
\end{enumerate}

Puis, nous avons aussi un cas de débogage. En effet, si l'on n'est pas entré dans le while depuis une seconde ou plus, il peut y avoir un problème. On recommence alors une seconde "propre", en mettant certaines variables à 0.

\item Les différentes fonctionnalités présentes
\label{sec:orge4f058a}

\begin{enumerate}
\item Le bouton console
\label{sec:org8bcaa9d}

Lorsque vous cliquez sur le bouton en bas à gauche, le jeu bascule avec l'interface console, ce qui permet au joueur de "choisir" s'il veut jouer avec SDL ou non.

\item F11
\label{sec:org8085d9f}

La touche F11 nous permet de mettre en plein écran, et d'avoir ainsi un petit effet sympas !

\item Taille de la fenêtre
\label{sec:orgae440e9}

La taille de la fenêtre est complètement géré par les variables \emph{TailleX et TailleY} qui, lorsque l'utilisateur change la taille de la fenêtre, se mettent à jour en temps réel.



\item Animations des cases
\label{sec:orgdcfb534}


Pour faire cette animation, nous récupérons dans chaque cas de bloc le nombre de déplacement qu'il doit faire, puis, nous divisons ce déplacement par le temps choisi par l'utilisateur.



\item Animation menu
\label{sec:org14e127c}
