Compterendu.org
**** Animation menu

Toutes les 0.15 seconde, on actualise toutes les images des boutons. Pour cela, il y a plusieurs cas :
1. Si l'utilisateur à la souris sur le bouton, nous affichons les images correspondant à la descente de 3 blocs
2. Sinon, soit nous terminons le mouvement d'un 2 en cours, soit, si aucun déplacement n'est en cours, il y a une probabilité de 1/30 de faire commencer un mouvement de deux sur le côté.


**** Les barres dans les options

Pour ceci, nous avons utilisé une petite astuce : la "barre" est en fait un bouton, qui, lorsque l'utilisateur clique dessus, enverra la position de la souris au programme. Suite à cela, la valeur de la variable correspondante est calculée avec un produit en croix. Enfin, nous modifions la position du rectangle qui joue le rôle de curseur sur l'écran.


** Fin de SDL

La fonction /end-sdl/ nous permet de fermet la fenêtre SDL proprement, ainsi que faire les opérations nécessaires pour vider la mémoire qui a besoin d'être libéré.






* Conclusion 

En guise de conclusion, nous vous souhaitons de bien vous amusez avec notre 2048 \smiley.



