Compterendu.tex

Toutes les 0.15 seconde, on actualise toutes les images des boutons. Pour cela, il y a plusieurs cas :
\begin{enumerate}
\item Si l'utilisateur à la souris sur le bouton, nous affichons les images correspondant à la descente de 3 blocs
\item Sinon, soit nous terminons le mouvement d'un 2 en cours, soit, si aucun déplacement n'est en cours, il y a une probabilité de 1/30 de faire commencer un mouvement de deux sur le côté.
\end{enumerate}


\item Les barres dans les options
\label{sec:orgda43e16}

Pour ceci, nous avons utilisé une petite astuce : la "barre" est en fait un bouton, qui, lorsque l'utilisateur clique dessus, enverra la position de la souris au programme. Suite à cela, la valeur de la variable correspondante est calculée avec un produit en croix. Enfin, nous modifions la position du rectangle qui joue le rôle de curseur sur l'écran.
\end{enumerate}
\end{enumerate}


\subsection{Fin de SDL}
\label{sec:org70a9c66}

La fonction \emph{end-sdl} nous permet de fermet la fenêtre SDL proprement, ainsi que faire les opérations nécessaires pour vider la mémoire qui a besoin d'être libéré.






\section{Conclusion}
\label{sec:org4aea38e}

En guise de conclusion, nous vous souhaitons de bien vous amusez avec notre 2048 \(\ddot\smile\).
\end{document}